
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;toffee&#34;]
  * module.postgresql_flexible_restore[0].null_resource.set-user-permissions-additionaldbs[&#34;toffee&#34;]
* Replace
  * module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_password_wo_version = 0 -> null
      ~ fqdn                              = "toffee-v14-flexible-restore-stg.postgres.database.azure.com" -> (known after apply)
      ~ id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-restore-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-restore-stg" -> (known after apply)
        name                              = "toffee-v14-flexible-restore-stg"
      ~ point_in_time_restore_time_in_utc = "2025-03-15T11:29:41Z" -> (known after apply) # forces replacement
      ~ sku_name                          = "GP_Standard_D2s_v3" -> "GP_Standard_D4s_v3"
      + storage_tier                      = (known after apply)
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git" -> null
            "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
            "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = null
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Platform Operations"
        }
      - zone                              = "1" -> null
        # (15 unchanged attributes hidden)

      + high_availability {
          + mode = "ZoneRedundant"
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "toffee-v14-flexible-restore-data-stg"
      + server_name         = "toffee-v14-flexible-restore-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_name      = "jenkins-ptl-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "toffee-v14-flexible-restore-data-stg"
      + server_name         = "toffee-v14-flexible-restore-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-restore-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-restore-stg/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-restore-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-restore-stg" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible_restore[0].azurerm_postgresql_flexible_server_database.pg_databases["toffee"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "toffee"
      + server_id = (known after apply)
    }

  # module.postgresql_flexible_restore[0].null_resource.set-user-permissions-additionaldbs["toffee"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "force_trigger"  = null
          + "name"           = "toffee-v14-flexible-restore"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

Plan: 6 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":637,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->